INSERT INTO area (area_name)
VALUES ('Москва'),
       ('Пермь'),
       ('Орел'),
       ('Уфа'),
       ('Коломна'),
       ('Одинцово'),
       ('Люберцы'),
       ('Звенигород'),
       ('Париж'),
       ('Калифорния'),
       ('Пекин');

INSERT INTO employer(employer_name, area_id)
VALUES ('hh.ru', 1),
       ('Яндекс', 1),
       ('Рога и Копыта', 2),
       ('Google', 2),
       ('Иванов и Ко', 3),
       ('Rambler', 1),
       ('Pedigree', 4),
       ('ООО Ваш Текстиль', 2),
       ('X5 Retail Group', 10),
       ('Walmart', 11),
       ('Amazon', 9);

INSERT INTO vacancy (employer_id,
                     position_name,
                     compensation_from,
                     compensation_to,
                     compensation_gross,
                     created_at)
VALUES (1, 'Разработчик', 20000, 30000, true, '2020-01-01'),
       (2, 'Тестировщик', 10000, 20000, true, '2020-01-02'),
       (2, 'Аналитик', 15000, 17000, false, '2020-01-03'),
       (3, 'Бухгалтер', 15000, 20000, false, '2020-01-05'),
       (4, 'Product manager', 40000, 60000, true, '2020-01-02'),
       (8, 'Тестировщик (профессиональный спящий)', 50000, null, true, '2020-01-01'),
       (11, 'Логист', null, null, null, '2020-01-07'),
       (5, 'Мешальщик сухих масс', null, 12000, false, '2020-02-08'),
       (6, 'Переворачиватель пингвинов', 17000, 40000, true, '2020-02-02'),
       (7, 'Дегустатор кормов для животных', 30000, 40000, true, '2020-02-06'),
       (8, 'Швея', null, null, null, '2020-04-01'),
       (10, 'Раскладчик товара', null, null, null, '2020-05-09'),
       (11, 'Разработчик Lua', null, null, null, '2005-01-10');



INSERT INTO person (first_name, middle_name, last_name, email, area_id)
VALUES ('Иван', 'Иванов', 'Иванович', 'vanya@gmail.com', 1),
       ('Анастасия', 'Сергеевна', 'Солнцева', '111@test.ru', 2),
       ('Олег', 'Филиппович', 'Тестовый', 'tofu@ya.ru', 1),
       ('Абрахим', 'Абрахимович', 'Абрамов', 'aaa@mail.ru', 6),
       ('Сергей', 'Игоревич', 'Зеленов', 'zelen@zel.ru', 5),
       ('Уильям', 'Джефферсон', 'Клинтон', 'president93@mail.ru', 10),
       ('Андрей', 'Николаевич', 'Болтнев', 'qwerty165@ya.ru', 5),
       ('Алексей', 'Александров', 'Романов', 'ya.raa@gmail.com', 1),
       ('Яна', 'Николаевна', 'Наушко', 'supergirl@post.net', 9),
       ('Ни ', 'Цзиньпин', 'Цзиньтао', 'xiaxioxie@wewechat.cn', 11);

INSERT INTO resume (person_id, desired_position, desired_compensation, experience)
VALUES (1, 'Разработчик Python', 20000, 6),
       (1, 'Разработчик Java', 22000, 0),
       (2, 'Тестировщик', 15000, 5),
       (3, 'Курьер', 10000, 20),
       (8, 'Президент', 30000, 48),
       (7, 'Флорист', 17000, 72),
       (9, 'Дизайнер', 30000, 0),
       (3, 'Погромист', 20000, 120),
       (4, 'Elevator man', 20000, 12),
       (3, 'Таксист', 7800, 36),
       (6, 'Автомотокинофототелерадиомонтер', 180000, 240);

INSERT INTO response(resume_id, vacancy_id, created_at)
VALUES (1, 1, '2020-02-02'),
       (2, 2, '2020-03-03'),
       (4, 2, '2020-03-30'),
       (8, 1, '2020-06-06'),
       (7, 7, '2020-01-04'),
       (3, 6, '2020-08-01'),
       (6, 3, '2020-06-05'),
       (1, 9, '2020-02-09'),
       (4, 12, '2020-11-15'),
       (5, 5, '2020-11-30');
